app/views/comments/_form.html.haml

    = f.label :state_id
    = f.select :state_id , @states.map { |s| [s.name, s.id] } , :selected => @car.state_id
---
SELECT "states".* FROM "states"