app/views/users/index.html.haml

SELECT "users".* FROM "users"
---
%h1 Users...
-@user.each do |r|