app/views/users/show.html.haml

SELECT "cars".* FROM "cars" WHERE "cars"."user_id" = $1  [["user_id", 1]]
---
  your cars:
  -@user.cars.each do |f|