app/controllers/api/v1/users_controller.rb

SELECT "cars".* FROM "cars" WHERE (user_id = 1)
---
  def index
    respond_with(Car.all.where('user_id = ?',current_user))