app/controllers/cars_controller.rb

 def create
   @car = @user.cars.new(car_params)
   #binding.pry
   if @car.save
---
INSERT INTO "cars" ("brand", "created_at", "model", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["brand", "mazda"], ["created_at", Fri, 06 Sep 2013 17:34:56 UTC +00:00], ["model", "doble caja `1998"], ["updated_at", Fri, 06 Sep 2013 17:34:56 UTC +00:00], ["user_id", 2]]

 def show
   @car = @user.cars.find(params[:id])
   @comment = @car.comments.build
   @states = State.all
---
SELECT "cars".* FROM "cars" WHERE "cars"."user_id" = $1 AND "cars"."id" = $2 LIMIT 1  [["user_id", 2], ["id", "edit"]]
SELECT "states".* FROM "states"

def edit
  @car = @user.cars.find(params[:id])
---
SELECT "cars".* FROM "cars" WHERE "cars"."user_id" = $1 AND "cars"."id" = $2 LIMIT 1  [["user_id", 2], ["id", "1"]]

 def search
   #@cars = Car.search("tag:#{params['search']}")
   #binding.pry
   @cars = @user.cars.search("tag:#{params['search']}")
---
SELECT "cars".* FROM "cars" WHERE "cars"."user_id" = $1  [["user_id", 14]]

 def set_user
   @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 44 ORDER BY "users"."id" ASC LIMIT 1