app/controllers/comments_controller.rb

INSERT INTO "comments" ("car_id", "previous_state_id", "state_id", "text") VALUES ($1, $2, $3, $4) RETURNING "id"  [["car_id", 56], ["previous_state_id", 1], ["state_id", 2], ["text", "q ondiiz"]]
---
  def create
    @comment = @car.comments.build(comment_params)
    #@comment.user = current_user
    if @comment.save

SELECT "cars".* FROM "cars" WHERE "cars"."id" = $1 ORDER BY "cars"."id" ASC LIMIT 1  [["id", 39]]
---
  def find_car
    @car = Car.find(params[:car_id])