app/controllers/tags_controller.rb

  def remove
      #binding.pry
      @car = Car.find(params[:car_id])
      @tag = Tag.find(params[:id])
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT 1  [["id", "46"]]
SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT 1  [["id", "13"]]