app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "last_name", "name", "password", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Fri, 06 Sep 2013 16:41:13 UTC +00:00], ["last_name", "Romero"], ["name", "Jesus"], ["password", "123456"], ["updated_at", Fri, 06 Sep 2013 16:41:13 UTC +00:00], ["username", "chuy"]]

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "users" SET "name" = $1, "password" = $2, "updated_at" = $3 WHERE "users"."id" = 2  [["name", "Junito"], ["password", ""], ["updated_at", Fri, 06 Sep 2013 16:52:33 UTC +00:00]]