app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @cars = @user.cars.page(params[:page]).per(3)
---
SELECT "cars".* FROM "cars" WHERE "cars"."user_id" = $1  [["user_id", 1]]