app/views/cars/show.html.haml

.asset
  - @car.assets.each do |asset|
---
SELECT "assets".* FROM "assets" WHERE "assets"."car_id" = $1  [["car_id", 14]]

#comments
  - if @car.comments.exists?
---
SELECT "comments".* FROM "comments" WHERE "comments"."car_id" = $1  [["car_id", 33]]
SELECT 1 AS one FROM "comments" WHERE "comments"."car_id" = $1 LIMIT 1  [["car_id", 33]]